Revit 2024 API
NurbSpline Class
A nurb spline.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class NurbSpline : Curve
Visual Basic
Public Class NurbSpline _
	Inherits Curve
Visual C++
public ref class NurbSpline : public Curve
Remarks
The nurb spline lies in the plane defined by control point, weight,knots,degree.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GeometryObject
 Autodesk.Revit.DB.Curve
 Autodesk.Revit.DB.NurbSpline
See Also
NurbSpline Members
Autodesk.Revit.DB Namespace